app/Controllers/Customers.php

SELECT *
FROM `customers`
---
    public function index()
    {
        $data['customers'] = $this->customers->findAll();

INSERT INTO `customers` (`full_name`, `email`, `phone`, `created_at`) VALUES ('dhhjjn', 'yuyugkjh@gmail.com', '0999887979', '2026-10-03 13:05:00')
---
    public function create()
    {
        $rules = [
            'full_name' => 'required|max_length[100]',
            'email'    => 'required|valid_email|max_length[100]',
            'phone'    => 'permit_empty|max_length[20]',
        ];

        if (! $this->validate($rules)) {
            return view('customers/form', [
                'title'    => 'New Customer',
                'customer' => $this->request->getPost(),
                'action'   => base_url('customers'),
            ]);
        }

        $this->customers->insert([
            'full_name'  => trim((string) $this->request->getPost('full_name')),
            'email'      => trim((string) $this->request->getPost('email')),
            'phone'      => trim((string) $this->request->getPost('phone')),
            'created_at' => date('Y-m-d H:i:s'),
        ]);