app/Controllers/Users.php

    public function index()
    {
        $data['users'] = $this->users->findAll();
---
SELECT *
FROM `users`

    public function create()
    {
        $rules = [
            'username' => 'required|max_length[50]|is_unique[users.username]',
            'full_name' => 'required|max_length[100]',
        ];

        if (! $this->validate($rules)) {
            return view('users/form', [
                'title' => 'New User',
                'user' => $this->request->getPost(),
                'action' => base_url('users'),
            ]);
        }

        $this->users->insert([
            'username' => trim((string) $this->request->getPost('username')),
            'full_name' => trim((string) $this->request->getPost('full_name')),
            'created_at' => date('Y-m-d H:i:s'),
        ]);
---
INSERT INTO `users` (`username`, `full_name`, `created_at`) VALUES ('George', 'Siray', '2026-10-03 12:59:43')

    public function edit(int $id)
    {
        $user = $this->users->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 1